# RbsReferenceLiningThickness Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsReferenceLiningThickness Property
ParameterTypeId Class See Also
---
"Lining Thickness"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsReferenceLiningThickness { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsReferenceLiningThickness As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsReferenceLiningThickness {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace